import { Typography } from "@mui/joy";

export const openingWordsSections = [
	`תגידו, גם אתם השתעשעתם פעם עם המחשבה שבנות אמורות לאהוב יינות אדומים, פשוט כי כל השאר הם לבנים?`,
	`ברוכים הבאים לעולם המרתק של תשבצי ההיגיון! תשבצים הם לא רק חידות לאנשים שאוהבים לחשוב מחוץ לקופסה, אלא גם הזדמנות לשחק עם השפה ולהנות ממשחקי מילים שנונים.`,
	`אני זוכר שפעם ישבתי בבר וראיתי בתפריט ״פיצה ירוקה״. שאלתי את המלצר, ״למה שמישהו ירצה לאכול פיצה שירקו אותה?״. הוא הסתכל עליי בשוק, אבל אותי זה הצחיק לגמרי כי הומור ומילים תמיד היו חלק בלתי נפרד ממני.`,
	`או כשיצאתי לדייט עם בחורה בשם סתיו. מבחינתי היה אחלה דייט, אך נראה שהיא פחות נהנתה כי מיד אחריו החלה לסנן אותי. החלטתי לכתוב לה: ״את לא יכולה לסנן אותי, קוראים לך סתיו! זה שם של עונה!״. מיותר לציין שגם על זה היא לא טרחה להגיב... אבל העיקר שהייתי מבסוט!`,
	`הסיפורים הקטנים האלה הם דוגמאות לדרך שבה אני אוהב לשחק עם המילים. התשבצים שבספר זה נוצרו באותה רוח של היתוליות ושנינות. אני מקווה שתיהנו מהחידות ותמצאו בהן אתגר והנאה כמו שאני מצאתי ביצירתן.`,
	`אז שבו בנוחות, קחו עיפרון, ותנו למילים לזרום. שיהיה לכם מסע מהנה ומאתגר!`,
];

export const OpeningWords = () => {
	return (
		<div>
			<Typography
				textAlign={"right"}
				level="h4"
				textColor={"text.tertiary"}
			>
				מפי המחבר
			</Typography>
			<Typography textAlign={"right"} level="h1" gutterBottom>
				מילות פתיחה
			</Typography>
			<div className="space-y-4">
				{openingWordsSections.map((section, index) => (
					<Typography
						textAlign={"right"}
						fontSize={"1.15rem"}
						key={index}
						dir="rtl"
					>
						{section}
					</Typography>
				))}
			</div>
		</div>
	);
};
